---
type: PhaseArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# PhaseArray

`Autodesk.Revit.DB.PhaseArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PhaseArray | — | `public PhaseArray ()` |
| Method | Append | — | `public virtual void Append ( Phase item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual PhaseArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Phase item , int index )` |
| Method | ReverseIterator | — | `public virtual PhaseArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Phase this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |